[
  {
    "id": "bhhs-vail-office",
    "title": "BHHS Vail Valley Office",
    "hints": [
      "Find the office where mountain dreams become reality.",
      "Look for the Berkshire Hathaway HomeServices sign in Vail Village.",
      "The professional team that helps families find their perfect Vail retreat."
    ],
    "funFact": "This office has helped countless families find their dream homes in the Rocky Mountains!",
    "originalNumber": 1,
    "maps": "https://www.google.com/maps/search/?api=1&query=Berkshire+Hathaway+HomeServices+Vail"
  },
  {
    "id": "covered-bridge",
    "title": "Covered Bridge",
    "hints": [
      "Begin where timber frames something precious flowing beneath.",
      "Lovers pause under wooden shelter as water rushes below.",
      "The iconic covered bridge spans Gore Creek in Vail Village."
    ],
    "funFact": "Vail's most popular proposal spot, decorated with thousands of twinkling lights in winter!",
    "originalNumber": 2,
    "maps": "https://www.google.com/maps/search/?api=1&query=Covered+Bridge+Vail"
  },
  {
    "id": "luxury-mountain-home",
    "title": "Premium Mountain Property",
    "hints": [
      "Find a home that showcases the best of Vail luxury living.",
      "Look for architectural excellence with mountain views.",
      "Spot a property that embodies BHHS quality and style."
    ],
    "funFact": "BHHS specializes in connecting buyers with exceptional mountain properties!",
    "originalNumber": 3,
    "maps": "https://www.google.com/maps/search/?api=1&query=Luxury+Homes+Vail+Village"
  },
  {
    "id": "clock-tower",
    "title": "Clock Tower",
    "hints": [
      "Find the timekeeper at the heart of Vail Village.",
      "A tower that marks time for both visitors and locals.",
      "The central meeting point where BHHS clients often gather."
    ],
    "funFact": "The Clock Tower is where many BHHS property tours begin - it's the perfect meeting spot!",
    "originalNumber": 4,
    "maps": "https://www.google.com/maps/search/?api=1&query=Clock+Tower+Vail"
  },
  {
    "id": "gore-creek-views",
    "title": "Gore Creek Waterfront",
    "hints": [
      "Discover where water adds value to every nearby property.",
      "Find the creek that makes Vail Village properties so desirable.",
      "Locate the natural feature that BHHS listings always highlight."
    ],
    "funFact": "Creek-front properties are among the most sought-after in Vail!",
    "originalNumber": 5,
    "maps": "https://www.google.com/maps/search/?api=1&query=Gore+Creek+Vail"
  },
  {
    "id": "family-friendly-area",
    "title": "Family Recreation Zone",
    "hints": [
      "Find where Vail families create lasting memories.",
      "Locate amenities that make properties perfect for families.",
      "The kind of neighborhood feature that increases home values."
    ],
    "funFact": "Family-friendly amenities are what make BHHS properties truly valuable for growing families!",
    "originalNumber": 6,
    "maps": "https://www.google.com/maps/search/?api=1&query=Vail+Village+Family+Activities"
  },
  {
    "id": "mountain-access-point",
    "title": "Mountain Adventure Gateway",
    "hints": [
      "Find where outdoor adventures begin steps from home.",
      "Locate the access point that adds premium value to nearby properties.",
      "The trailhead that makes Vail living extraordinary."
    ],
    "funFact": "Direct mountain access is the #1 feature BHHS clients request!",
    "originalNumber": 7,
    "maps": "https://www.google.com/maps/search/?api=1&query=Vail+Mountain+Trails"
  },
  {
    "id": "community-gathering",
    "title": "Community Heart",
    "hints": [
      "Discover where neighbors become lifelong friends.",
      "Find the social center that strengthens property values.",
      "The gathering place that makes a neighborhood feel like home."
    ],
    "funFact": "Strong communities create the most desirable neighborhoods - that's the BHHS advantage!",
    "originalNumber": 8,
    "maps": "https://www.google.com/maps/search/?api=1&query=Vail+Village+Community+Center"
  },
  {
    "id": "ski-slope-access",
    "title": "Slope-Side Living",
    "hints": [
      "Find where you can ski from your front door to world-class slopes.",
      "Locate the ultimate ski-in, ski-out property feature.",
      "The access point that defines true Vail luxury living."
    ],
    "funFact": "Ski-in, ski-out properties are the crown jewel of BHHS's Vail portfolio!",
    "originalNumber": 9,
    "maps": "https://www.google.com/maps/search/?api=1&query=Vail+Ski+Slopes+Access"
  }
]